import Accordion from './component/Accordion'
import "./index.css"

function AccordionPage() {
  const items=[
    {
      id:'4kjler',
      lable:'چگونه میتوانم در بلو حساب باز کنم؟',
      content:`
        ۱- اپلیکیشن بلو را دانلود و نصب کنید (لینک صفحه‌ی دانلود)
        ۲- با خط تلفنی که به‌نام خودتان و فعال است، ثبت‌نام را شروع کنید
        ۳- همراه داشتن اصل کارت ملی هوشمند یا همراه داشتن اصل شناسنامه و «کد رهگیری درخواست صدور کارت ملی هوشمند» برای ثبت تصاویر آن‌ها
        ۴- ضبط و ارسال یک ویدئو‌ی سلفی به‌صورت زنده`
    },
    {
      id:'3efd',
      lable:'هزینه باز کردن حساب و دریافت بلو کارت چقدر است؟',
      content:'باز کردن حساب، صدور و ارسال بلوکارت کاملا رایگان است.'
    },
    {
      id:'4fdcx',
      lable:'شرایط دریافت وام بلو کارت چقدر است؟',
      content:`
      برای دریافت وام نقدی بلو در مرحله اول، میانگین ماهانه‌ موجودی شما در ۳ ماه متوالی باید بیشتر از ۳ میلیون تومان باشد. بعد از تعیین مبلغ اعتبار از روی میانگین ۳ ماه، سابقه چک برگشتی، تسهیلات معوق و امتیاز اعتباری شما از سامانه‌های بانک مرکزی استعلام می‌شود. به شرط نداشتن چک برگشتی و تسهیلات معوق، وام به شما تعلق می‌گیرد.
بعد از تسویه این وام و با توجه به رفتار مالی خود، می‌توانید وام‌های بعدی را تا سقف ۴۰ میلیون تومان دریافت کنید.`
    }
  ];
   
  return <Accordion items={items} />

}

export default AccordionPage;

// function fibonacci(n){
//   const fibo=[0,1]
//   if(n<=1) return n;

//   for(let i=2;i<=n;i++)
//     fibo[i]=fibo[i-1]+fibo[i-2]
//   return fibo[n]
  
// }
// console.log(fibonacci(12))

// function fibonacci(n){
//   if(n<=1)
//     return n;
//   else return fibonacci(n-1)+fibonacci(n-2)
// }

// console.log(fibonacci()) 